Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདག་ལ་ཕན་འདོགས་པ་ཕུན་སུམ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as perfect benefit for oneself.

source: བདག་གི་དགེ་བའི་རྩ་བ་རྣམས་འབྲས་བུ་ཡོད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as having one’s roots of virtue bear fruit.

source: བདག་ཁ་དོག་རྒྱས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as one’s own physical luster.

source: བདག་གི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as diligence to accomplish one’s own benefit.

source: བདག་གི་ཕྱིར་མཐོ་རིས་སུ་འཇུག་པའི་བསམ་གཏན་ནི་དཔེར་ན་འཇིག་པའི་བསྐལ་པ་བདུན་གྱི་བར་དུ་བདག་འཇིག་རྟེན་འདིར་མི་འོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as concentration that grants access to the higher realms for one’s own benefit, thereby, for example, preventing one’s birth in this world for the duration of seven eons of destruction.

source: བདག་ལ་ཕན་པ་དང་ལྡན་པའི་ཤེས་རབ་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་སེར་སྐྱའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as insight imbued with benefit for oneself, as exemplified by the prince Kapila.

source: འདི་དག་ནི་བདག་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་ཟང་ཟིང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of material things dedicated to benefiting oneself.

source: དེ་ལ་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the Dharma?

source: རྒྱན་སྣ་ཚོགས་ཀྱི་ངོ་བོས་བརྒྱན་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་སྦྱིན་པའིའོ། །
en: Generosity that gives Dharma ripens as being adorned with the finest of numerous ornaments.

source: མི་དམིགས་པ་ལ་གནས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the discipline of abiding by nonapprehension.

source: སེམས་ཅན་གྱི་འདུ་ཤེས་དང་བྲལ་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the patience of being free from the notion of sentient beings.

source: ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གཉིས་སུ་མེད་པར་སྤྱོད་པའི་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as overpowering others through the nondual practice of the transcendent Dharma.

source: མངོན་པར་མ་ཞེན་ཅིང་སེམས་མཉམ་པ་ཉིད་ཐོབ་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the transcendent Dharma of detachment and the attainment of the mind of equality.

source: ཆོས་ཐམས་ཅད་ལ་གཉིས་སུ་མེད་པས་གསལ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the clarification of all Dharma teachings through nonduality.

source: འདི་དག་ནི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of the Dharma.

source: དེ་ལ་དོན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the objectives?

source: སྦྱིན་པའི་འབྲས་བུ་ལོངས་སྤྱོད་ཆེན་པོ་གང་ཡིན་པ་དེ་ནི་དེའི་དོན་ཏོ། །
en: The objective of generosity is the great wealth that is an effect of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་བདེ་འགྲོ་གང་ཡིན་པ་དེ་ནི་དེའི་དོན་ཏོ། །
en: The objective of discipline is the higher realms that result from discipline.

source: བཟོད་པའི་འབྲས་བུ་གཟུགས་བཟང་བ་གང་ཡིན་པ་དེ་ནི་དེའི་དོན་ཏོ། །
en: The objective of patience is an excellent physical form resulting from patience.

source: བརྩོན་འགྲུས་ཀྱི་འབྲས་བུ་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་བྱ་བ་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་དེའི་དོན་ཏོ། །
en: The objective of diligence is the accomplishment of mundane and supramundane actions that result from diligence.

source: བསམ་གཏན་སྐྱེ་བར་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་དེའི་དོན་ཏོ། །
en: The objective of concentration is concentration that is dedicated to rebirth.

source: ཤེས་རབ་དང་བྲལ་བ་དང་རྒྱུ་འཐུན་པ་གང་ཡིན་པ་དེ་ནི་དེའི་དོན་ཏོ། །
en: The objective of insight is insight, absence, and causal accordance.

source: འདི་དག་ནི་དོན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the objectives.

source: སྤོང་བ་དང་རབ་ཏུ་ལྡན་པའི་ལུས་མི་འཇིག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity consists in an indestructible body endowed with relinquishment.

source: སྤོང་བའི་རྒྱུས་རབ་ཏུ་མི་རྨོངས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as freedom from ignorance caused by relinquishment.

source: ཆོས་ལ་བཟོད་པ་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as not abandoning the acceptance of the Dharma.

source: སྦྱོར་བ་ཐམས་ཅད་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as accomplishing all engagements.

source: བསམ་གཏན་གྱི་འབྲས་བུ་འགོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the cessation that is an effect of concentration.

source: རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་བཟུང་བའི་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as mastering the vajra-like absorption.

source: དེ་ལ་སྤྲོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of happiness?

source: སྦྱིན་པ་བྱིན་པ་ན་ནམ་ཡང་རྨུགས་པ་དང་གཉིད་དུ་མ་གྱུར་ཅིང་བདག་ལ་དགའ་བ་མི་སྐྱེད་པ་གང་ཡིན་པ་དེ་ནི་དཔེར་ན་ཤཱཀྱ་ཆེན་པོའི་ནགས་ཁྲོད་དཔག་ཚད་དགུ་བཅུ་རྩ་དྲུག་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as never becoming dull or sleepy when practicing generosity and as not creating happiness for oneself, as exemplified by the great Śākya’s forest that measured ninety-six thousand leagues.

source: བསླབ་པའི་ཕྱིར་རྒྱལ་སྲིད་སྤངས་ཏེ་སྤོང་བ་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་དོན་ཡོད་གནས་ན་འདུག་ཅིང་བརྫུན་དུ་སྨྲ་བ་མི་ཟེར་བ་ལྟ་བུ་དང་། ལུས་ཀྱི་ཕྱིར་གཞན་དག་ཕ་མ་གསོད་ཅིང་སྡིག་པ་དག་བྱེད་པ་ན་ངས་སྦྱིན་པ་དང་ཆོས་མ་སྤངས་པས་དེ་ནི་སངས་རྒྱས་ཡིན་ནོ་བར་ཐེ་ཙོམ་མེད་པར་ཤེས་པར་འགྱུར་རོ་ཞེས་ཇི་སྐད་གསུངས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as giving up the kingdom for the sake of training, as exemplified by Prince Meaningful, who was reliable and never lied. Likewise, whereas others may kill their parents and engage in other unwholesome actions for the sake of their bodies, I abandoned neither generosity nor the Dharma. Thus, it was said, ‘Without a doubt, he will be known as a buddha.’

source: ཕ་རོལ་རྗེས་སུ་བསྲུང་བའི་བཟོད་པ་ནི་དཔེར་ན་གླང་པོ་ཆེ་གནད་དུ་ཕོག་ཀྱང་བསྲུང་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as caring for others, as exemplified by the elephant who protected others even when mortally wounded.

source: བརྩོན་འགྲུས་ཀྱིས་ལོ་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་ཏུ་ཆོས་སྨྲ་བ་ལ་བསྟེན་ཀྱང་གནོད་པ་མེད་ཅིང་མི་སྐྱོ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as diligently teaching the Dharma for thirty-six thousand years, flawlessly and tirelessly.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར་བསམ་གཏན་བྱེད་པ་ནི་དཔེར་ན་འཛམ་བུའི་གླིང་ནས་བདག་ཉིད་མཐོ་རིས་སུ་སོང་བ་བྲམ་ཟེའི་བུ་ཕན་ཚོལ་གྱི་སྔོན་གྱི་ཚུལ་ལས་ཤེས་པར་བྱ་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as concentration for the sake of benefiting sentient beings, as can be learned from the way I traveled from Jambudvīpa to the heavens in the past, seeking to benefit a brahmin youth.

source: ཤེས་རབ་ནི་དཔེར་ན་སྨན་ཆེན་གྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight is exemplified by great medicine.

source: འདི་དག་ནི་སྤྲོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of happiness.

source: དེ་ལ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of emptiness?

source: སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཁྱིམ་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as attaining the home of the concentration of emptiness.

source: དམིགས་པ་མེད་པ་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the attainment of nonapprehension.

source: ས་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the attainment of the spiritual levels.

source: བསྒོམ་པའི་སྟོབས་ཅན་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as powerful training.

source: ངེས་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as certainty.

source: བྱ་བ་ཐམས་ཅད་དུ་ཐུན་མོང་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being extraordinary throughout all activities.

source: འདི་དག་ནི་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of emptiness.

source: དེ་ལ་མཚན་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of signlessness?

source: དུས་ཐམས་ཅད་དུ་མཚན་མ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity always ripens as signlessness.

source: ཐམས་ཅད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as universality.

source: ཟིལ་གྱིས་མི་ནོན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being impossible to outshine.

source: ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as being completely dedicated.

source: རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as being uninterrupted.

source: ཡོངས་སུ་གཅོད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being decisive.

source: འདི་དག་ནི་མཚན་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of signlessness.

source: དེ་ལ་སྨོན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of wishlessness?

source: སྨོན་པ་མེད་པར་མྱུར་དུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as quickly achieving wishlessness.

source: ཆགས་པ་མེད་པ་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as achieving detachment.

source: ཁམས་གསུམ་ལ་མངོན་པར་མི་བལྟ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as disregard for the three realms.

source: བར་མ་དོར་ཆུད་མི་ཟ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as nothing being wasted on the way.

source: ཐར་པ་ལ་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as observing liberation.

source: བག་ཆགས་འདོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as dispelling karmic imprints.

source: འདི་དག་ནི་སྨོན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of wishlessness.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་སྐུ་མ་དུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as being free from physical fatigue when seated cross-legged at the seat of awakening.

source: སྐུ་གཟི་བྱིན་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as physical splendor.

source: ཆོས་མངོན་པར་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as proclaiming the Dharma.

source: ཆོས་མངོན་པར་བརྗོད་ཅིང་ཕྱིན་ཅི་མ་ལོག་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as proclaiming and comprehending the Dharma.

source: ཐར་པ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seizing liberation.

source: སྒྱུ་མར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as realizing the illusion-like.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་གཞན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of additional ripening?

source: ཚོང་པ་ག་གོན་གྱིས་མཆོད་སྟོན་གསོལ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the offerings made by the merchant Trapuṣa.

source: ཀླུ་བཏང་བཟུང་གིས་དཀྲིས་ཏེ་བཞུགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as being shielded by the nāga Mucilinda while seated.

source: ཚངས་པ་ཉེ་བར་འོངས་ནས་གསོལ་བ་འདེབས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as Brahmā approaching and offering his request.

source: སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the seeing of the buddha eye.

source: གདུལ་བ་རྣམས་ལ་ཡང་དང་ཡང་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as repeatedly watching over those to be trained.

source: གཏི་མུག་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་ན། འདི་ལྟར་གཅིག་ནས་གཅིག་ཏུ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སྒྲ་མངོན་པར་གྲགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight is such that when one turns the Dharma wheel without delusion, the sound is heard from one realm to next, all the way to the Realm of Brahmā.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་གཞན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of additional ripening.

source: དེ་ལ་སྦྱོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of application?

source: ལྔ་པོ་དག་ཉེ་བར་འོངས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as approaching the five mendicants.

source: བྱ་བ་དང་བྱ་བ་མ་ཡིན་པ་དག་ཐོས་ནས་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is such when they hear what is to be done and what is to be refrained from, they act accordingly.

source: ལྷག་པའི་ང་རྒྱལ་མེད་པས་ཉེ་བར་གནས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as remaining free from exaggerating pride.

source: བདུད་རྩིས་ཚིམ་པར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as giving satisfaction by means of the elixir.

source: ལྔ་པོ་དག་ལ་བཀའ་སྩོལ་ཅིང་གོ་བར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as speaking to and instilling understanding in the five mendicants.

source: ལྷ་བྱེ་བ་ཕྲག་ལྔ་པོ་དག་ལ་བདུད་རྩི་རྟོགས་པར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as conveying the understanding of the elixir to fifty million gods.

source: འདི་དག་ནི་སྦྱོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of application.

source: དེ་ལ་གནས་དང་གནས་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the correct and the incorrect?

source: གནས་དང་གནས་མ་ཡིན་པ་ཉིད་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as attaining knowledge of the correct and the incorrect.

source: དམ་བཅས་པ་གཞན་དུ་མི་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as unswerving resolve.

source: ཡང་དག་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as authentic realization.

source: དམ་བཅས་པ་སྟོབས་ཅན་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as powerful resolve.

source: སྨྲ་བ་གཞན་དུ་མི་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as speech that does not deviate.

source: དུས་ཤེས་ནས་སྒོམ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as training based on the knowledge of time.

source: འདི་དག་ནི་གནས་དང་གནས་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the correct and the incorrect.

source: དེ་ལ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་ཡང་དག་པར་བླང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of proper engagement in actions of the past, present, and future?

source: ལས་ཀྱི་སྐྱེ་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as comprehending the genesis of karma.

source: ལས་ཀྱི་རྒྱུ་ལས་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding that accords with the causes of karma.

source: རྐྱེན་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding conditions.

source: ལས་རྣམས་ཀྱི་སྤོང་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding the relinquishment of karma.

source: སྤོང་བའི་ཐབས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding the means for relinquishing karma.

source: སྤོང་བའི་སྐྱེ་བ་མེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as understanding the unborn nature of relinquishment.

source: འདི་དག་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་ཡང་དག་པར་བླང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of proper engagement in actions of the past, present, and future.

source: དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the various dispositions in the world?

source: སེམས་ཅན་རྣམས་ཀྱི་ཁམས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ།
en: Generosity ripens as understanding the dispositions of sentient beings.

source: ཁམས་ཐ་དད་པ་མ་ཡིན་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ།
en: Discipline ripens as understanding that the dispositions are not different.

source: ཁམས་ལ་སེམས་ཅན་མེད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ།
en: Patience ripens as understanding that the dispositions do not contain any sentient being.

source: ཁམས་ཀྱི་སྦྱོར་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ།
en: Diligence ripens as understanding the applications of the dispositions.

source: ཁམས་རབ་ཏུ་བསྒྲུབ་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ།
en: Concentration ripens as understanding the accomplishments pertaining to the dispositions.

source: ཁམས་ཀྱི་ངེས་པར་བྱུང་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as deliverance that occurs due to the dispositions.

source: འདི་དག་ནི་འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the various dispositions in the world.

source: དེ་ལ་དབང་པོ་ཡོངས་སུ་རྫོགས་པ་མཁྱེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of complete knowledge of the faculties?

source: ལུས་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as understanding related to the body.

source: མིག་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding of the eyes, ears, nose, and tongue.

source: སེམས་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding of the mind.

source: ཕོའི་དབང་པོ་དང་། མོའི་དབང་པོ་དང་། སྲོག་གི་དབང་པོ་དང་། བདེ་བའི་དབང་པོ་དང་། སྡུག་བསྔལ་གྱི་དབང་པོ་དང་། ཡིད་བདེ་བའི་དབང་པོ་དང་། ཡིད་མི་བདེ་བའི་དབང་པོ་དང་། བཏང་སྙོམས་ཀྱི་དབང་པོ་སྟེ། དབང་པོ་དྲུག་པོ་འདི་དག་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding of six faculties: the male faculty, the female faculty, and the life force faculty, as well as the faculties of pleasure, pain, mental pleasure, mental displeasure, and neutral sensation.

source: དད་པའི་དབང་པོ་ནས་ཤེས་རབ་ཀྱི་དབང་པོའི་བར་དུ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding all the faculties, from faith through insight.

source: ཀུན་ཤེས་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: Insight ripens as knowledge of the faculties of understanding and comprehension.

source: འདི་དག་ནི་དབང་པོ་ཡོངས་སུ་རྫོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of complete knowledge of the faculties.

source: དེ་ལ་འཇིག་རྟེན་གྱི་མོས་པ་དུ་མའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the myriad inclinations of the world?

source: མོས་པ་ལ་སྦྱོར་བ་ཡང་དག་པར་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as accomplishing engagement with the inclinations.

source: སྦྱོར་བ་དེ་ལ་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as unimpeded engagement.

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་དུས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding time in accordance with inclinations.

source: ངེས་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding with certainty.

source: སྐྱེ་བ་དང་། མི་སྐྱེ་བའི་ཟད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding the exhaustion of arising and nonarising.

source: མོས་པ་དེ་ལྟ་བུར་ཉེ་བར་ཞི་བ་དང་། ཐབས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as pacification in line with one’s devotion and the means to its attainment.

source: འདི་དག་ནི་མོས་པ་དུ་མའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the myriad inclinations.

source: དེ་ལ་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the paths that lead to all destinations?

source: དཀའ་བ་བུལ་བར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the difficult and slow.

source: དཀའ་བ་མྱུར་བར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the difficult and fast.

source: སླ་བ་བུལ་བར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the easy and slow.

source: སླ་བ་མྱུར་བར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the easy and fast.

source: འགྲོ་བ་དང་འབྲེལ་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding of movement.

source: འགྲོ་བ་དང་འབྲེལ་པ་ཡོད་པ་དང་མེད་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as understanding the presence and absence of movements and connections.

source: འདི་དག་ནི་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the paths that lead to all destinations.

source: དེ་ལ་དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that engage in the faculties, powers, factors of awakening, concentrations, liberations, absorptions, and meditative attainments?

source: ཆོས་འདི་རྣམས་ཀྱི་བདེ་བ་འདི་ངེས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as ascertainment of the bliss of those factors.

source: ཅང་ཤེས་པ་མཚུངས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as being equal to those of noble origin.

source: གཞན་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་ཆོས་རྣམས་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience comprises the qualities of dedication to benefiting others.

source: བདག་ལ་ཕན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as benefit for oneself.

source: སྣོད་ཇི་ལྟ་བ་བཞིན་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as correct comprehension of the recipients.

source: རྒྱུ་འཐུན་པ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as realization of concordant causes.

source: དེ་དག་ནི་དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that engage in the faculties, powers, factors of awakening, concentrations, liberations, absorptions, and meditative attainments.

source: དེ་ལ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of knowledge of past existences?

source: སྔོན་གྱི་གནས་ལུས་ཀྱིས་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the bodily understanding of past contexts.

source: འགྲོ་བ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the comprehension of lives.

source: ལས་ཀྱི་མཐའ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the comprehension of the parameters of activities.

source: ཉོན་མོངས་པ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as comprehension of defilements.

source: སེམས་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as comprehension of mindsets.

source: རྣམ་པ་ཐམས་ཅད་པའི་མྱ་ངན་ལས་འདས་པ་ཇི་སྙེད་པ་ཀུན་ཡང་དག་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as correct perception of all facets of the nirvāṇa that is complete in all aspects.

source: འདི་དག་ནི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of knowledge of past existences.

source: དེ་ལ་ལྷའི་མིག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the divine eye?

source: ལྷའི་མིག་དང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the clarity of the divine eye.

source: སྦྱོར་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as its employment free from unwholesomeness.

source: མ་ལུས་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing in which nothing is left out.

source: རྒུད་པ་དང་། དར་བ་དང་། བཀུར་སྟི་མེད་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing destitution, flourishing, and lack of respect.

source: དེ་དག་གི་ངེས་པར་བྱུང་བ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing the associated deliverance.

source: འདི་དག་ནི་ལྷའི་མིག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of the divine eye.

source: དེ་ལ་ཟག་པ་ཟད་པའི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections with the power to exhaust the contaminants?

source: ཟག་པའི་སྐྱོན་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the flaws of contaminants.

source: ཟག་པ་རྣམས་ལ་མངོན་པར་མི་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as displeasure with contaminants.

source: ཟག་པ་རྣམས་ལ་མི་ལྟ་ཞིང་སེམས་ཀྱིས་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as disregarding and mentally giving up contaminants.
